
# String Functions in MySQL

String functions are used to **manipulate, format, and analyze text data** in MySQL.
Each function below is explained briefly and demonstrated using a MySQL-compatible query.


## Sample EMP Table Setup

The following table is used for string function examples that operate on table data.

In [ ]:

CREATE TABLE emp (
    empno INT PRIMARY KEY,
    ename VARCHAR(20),
    job VARCHAR(20)
);

INSERT INTO emp VALUES
(1, 'ALLEN', 'SALESMAN'),
(2, 'SMITH', 'CLERK'),
(3, 'BLAKE', 'MANAGER'),
(4, 'CLARK', 'MANAGER'),
(5, 'JONES', 'ANALYST');


## UPPER Function

The `UPPER` function converts all characters in a string to uppercase.

In [ ]:

SELECT UPPER('today is a wonderful day') AS result;


## LOWER Function

The `LOWER` function converts all characters in a string to lowercase.

In [ ]:

SELECT LOWER('TODAY IS A WONDERFUL DAY') AS result;


This query capitalizes the first character and lowercases the remaining string.

In [ ]:

SELECT CONCAT(
    UPPER(LEFT('today is a wonderful day', 1)),
    LOWER(SUBSTRING('today is a wonderful day', 2))
) AS result;


## LENGTH Function

The `LENGTH` function returns the number of characters in a string.

In [ ]:

SELECT LENGTH('AB CD') AS length_value;


## Filtering Rows Using LENGTH

This query selects employees whose names contain exactly 5 characters.

In [ ]:

SELECT ename
FROM emp
WHERE LENGTH(ename) = 5;


## SUBSTRING Function

`SUBSTRING` extracts a portion of a string based on position and length.

In [ ]:

SELECT SUBSTRING('ABCDEF', 2, 3) AS result;


## SUBSTRING Without Length

Extracts the substring from the given position till the end.

In [ ]:

SELECT SUBSTRING('ABCDEF', 2) AS result;


## SUBSTRING with Negative Position

Negative position extracts characters starting from the end.

In [ ]:

SELECT SUBSTRING('ABCDEF', -1) AS result;


## SUBSTRING with Negative Position and Length

In [ ]:

SELECT SUBSTRING('ABCDEF', -3, 2) AS result;


## SUBSTRING Used in WHERE Clause

In [ ]:

SELECT *
FROM emp
WHERE SUBSTRING(ename, 2, 2) = 'LA';


## LOCATE Function (Equivalent to INSTR)

`LOCATE` returns the position of a substring within a string.

In [ ]:

SELECT LOCATE('*', 'ABC*D') AS position;


## LOCATE with Multi-Character Search

In [ ]:

SELECT LOCATE('DC', 'ABDCDEF') AS position;


## LPAD Function

`LPAD` pads a string on the left with a specified character.

In [ ]:

SELECT LPAD('ABCD', 10, '*') AS padded_value;


## RPAD Function

`RPAD` pads a string on the right with a specified character.

In [ ]:

SELECT RPAD('ABCD', 10, '*') AS padded_value;


## LENGTH with Leading and Trailing Spaces

In [ ]:

SELECT LENGTH('             ABC                ') AS length_value;


## LTRIM Function

`LTRIM` removes leading spaces or specified characters.

In [ ]:

SELECT 
    LTRIM('             ABC                ') AS trimmed_value,
    LENGTH(LTRIM('             ABC                ')) AS length_after_ltrim;


## LTRIM with Custom Character

In [ ]:

SELECT LTRIM('******ABC********', '*') AS result;


## RTRIM Function

In [ ]:

SELECT 
    RTRIM('             ABC                ') AS trimmed_value,
    LENGTH(RTRIM('             ABC                ')) AS length_after_rtrim;


## RTRIM with Custom Character

In [ ]:

SELECT RTRIM('******ABC********', '*') AS result;


## TRIM Function

`TRIM` removes both leading and trailing spaces or characters.

In [ ]:

SELECT 
    TRIM('             ABC                ') AS trimmed_value,
    LENGTH(TRIM('             ABC                ')) AS length_after_trim;


## TRIM with Custom Character

In [ ]:

SELECT TRIM('*' FROM '******ABC********') AS result;


## REPLACE Function

`REPLACE` substitutes occurrences of a substring within a string.

In [ ]:

SELECT 'ENTRY' AS original,
       REPLACE('ENTRY', 'TRY', 'TER') AS modified;


## REPLACE Used on Table Column

In [ ]:

SELECT job,
       REPLACE(job, 'SALESMAN', 'MARKETING') AS updated_job
FROM emp;


## Summary

This notebook covered commonly used MySQL string functions including:
- Case conversion
- Length calculation
- Substring extraction
- Pattern searching
- Padding and trimming
- String replacement

These functions are essential for data cleaning, formatting, and reporting.